<template>
  <div class="page has-navbar" v-nav="{title: '编辑个人信息', showBackButton: true}">
    <div class="page-content">
      <div>
        <div class="item item-divider">
          填写您的基本信息：
        </div>
        <von-input
                type="text"
                :value.sync="username"
                label="用户名"
                placeholder="用户名"
        >
        </von-input>
        <von-input
                type="password"
                :value.sync="password"
                label="密码"
                placeholder="密码"
        >
        </von-input>

        <von-input
                type="email"
                :value.sync="email"
                label="E-mail"
                placeholder="E-mail"
        >
        </von-input>
        <von-input
                type="tel"
                :value.sync="tel"
                label="手机号"
                placeholder="手机号"
        >
        </von-input>
        <von-input
                type="text"
                :value.sync="school"
                label="所在院校"
                placeholder="所在院校"
        >
        </von-input>
        <von-input
                type="text"
                :value.sync="signature"
                label="个性签名"
                placeholder="个性签名"
        >
        </von-input>
      </div>
      <div>
        <div class="item item-divider">
          请选择您的性别:
        </div>
        <von-radio :options="genderOptions" :value.sync="gender"></von-radio>
      </div>
      <div>
        <div class="item item-divider">
          选择您所属的行政区划：
        </div>
        <cascade
                :fields="fields"
                :data="cities"
                :value.sync="value">
        </cascade>
        <md-button class="button button-balanced" @click="clicked()">
          确认修改
        </md-button>
      </div>

    </div>
  </div>
</template>
<style>
  .page-content .button{
    left: 30%;
  }
</style>
<script>
    export default {
        data(){
            return {
                menus: [
                    {
                        name:{
                            key:'用户名',
                            value:'Bugzhang'
                        },
                        photo:{
                            key:'头像',
                            value:''
                        },
                        gender:{
                            key:'性别',
                            value:'男'
                        },
                        email:{
                            key:'邮箱',
                            value:'nuptunee@gmail.com'
                        },
                        school:{
                            key:'学校',
                            value:'中南大学'
                        },
                        address:{
                            key:'地区',
                            value:'湖南 长沙'
                        },
                        signature:{
                            key:'个性签名',
                            value:'头像是我老婆'
                        }
                    }
                ],

                fields: [
                    "省", "市", "区"
                ],
                cities: [
                    ['湖南省','市辖区','岳麓区'],
                    ['湖南省','市辖区','芙蓉区'],
                    ['湖南省','市辖区','天心区'],
                    ['湖南省','市辖区','开福区'],
                    ['湖南省','市辖区','雨花区'],
                    ['湖南省','县','长沙县'],
                    ['湖南省','县','星沙镇'],
                    ['湖南省','县','望城县'],
                    ['湖南省','县','高塘岭镇'],
                    ['湖南省','县','宁乡县'],
                    ['湖南省','县','玉潭镇'],
                    ['湖南省','县','浏阳市'],
                    ['天津市','市辖区','南开区'],
                    ['天津市','市辖区','和平区'],
                    ['天津市','市辖区','河东区'],
                    ['天津市','市辖区','河西区'],
                    ['天津市','市辖区','河北区'],
                    ['天津市','市辖区','红桥区'],
                    ['天津市','市辖区','塘沽区'],
                    ['天津市','市辖区','汉沽区'],
                    ['天津市','市辖区','大港区'],
                    ['天津市','市辖区','东丽区'],
                    ['天津市','市辖区','西青区'],
                    ['天津市','市辖区','津南区'],
                    ['天津市','市辖区','北辰区'],
                    ['天津市','市辖区','武清区'],
                    ['天津市','市辖区','宝坻区'],
                    ['天津市','县','蓟县'],
                    ['天津市','县','宁河县'],
                    ['天津市','县','芦台镇'],
                    ['天津市','县','静海县'],
                    ['北京市', '市辖区', '东城区'],
                    ['北京市', '市辖区', '西城区'],
                    ['北京市', '市辖区', '朝阳区'],
                    ['北京市', '市辖区', '丰台区'],
                    ['北京市', '市辖区', '石景山区'],
                    ['北京市', '市辖区', '海淀区'],
                    ['北京市', '市辖区', '门头沟区'],
                    ['北京市', '市辖区', '房山区'],
                    ['北京市', '市辖区', '通州区'],
                    ['北京市', '市辖区', '顺义区'],
                    ['北京市', '市辖区', '昌平区'],
                    ['北京市', '市辖区', '大兴区'],
                    ['北京市', '市辖区', '怀柔区'],
                    ['北京市', '市辖区', '平谷区'],
                    ['北京市', '县', '密云县'],
                    ['北京市', '县', '延庆县'],
                    ['上海市', '市辖区', '黄浦区'],
                    ['上海市', '市辖区', '徐汇区'],
                    ['上海市', '市辖区', '长宁区'],
                    ['上海市', '市辖区', '静安区'],
                    ['上海市', '市辖区', '普陀区'],
                    ['上海市', '市辖区', '闸北区'],
                    ['上海市', '市辖区', '虹口区'],
                    ['上海市', '市辖区', '杨浦区'],
                    ['上海市', '市辖区', '闵行区'],
                    ['上海市', '市辖区', '宝山区'],
                    ['上海市', '市辖区', '嘉定区'],
                    ['上海市', '市辖区', '浦东新区'],
                    ['上海市', '市辖区', '金山区'],
                    ['上海市', '市辖区', '松江区'],
                    ['上海市', '市辖区', '青浦区'],
                    ['上海市', '市辖区', '奉贤区'],
                    ['上海市', '县', '崇明县'],
                    ['浙江省', '杭州市', '上城区'],
                    ['浙江省', '杭州市', '下城区'],
                    ['浙江省', '杭州市', '江干区'],
                    ['浙江省', '杭州市', '拱墅区'],
                    ['浙江省', '杭州市', '西湖区'],
                    ['浙江省', '杭州市', '滨江区'],
                    ['浙江省', '杭州市', '萧山区'],
                    ['浙江省', '杭州市', '余杭区'],
                    ['浙江省', '杭州市', '富阳区'],
                    ['浙江省', '杭州市', '桐庐县'],
                    ['浙江省', '杭州市', '淳安县'],
                    ['浙江省', '杭州市', '建德市'],
                    ['浙江省', '杭州市', '临安市'],
                    ['浙江省', '宁波市', '海曙区'],
                    ['浙江省', '宁波市', '江东区'],
                    ['浙江省', '宁波市', '江北区'],
                    ['浙江省', '宁波市', '北仑区'],
                    ['浙江省', '宁波市', '镇海区'],
                    ['浙江省', '宁波市', '鄞州区'],
                    ['浙江省', '宁波市', '象山县'],
                    ['浙江省', '宁波市', '宁海县'],
                    ['浙江省', '宁波市', '余姚市'],
                    ['浙江省', '宁波市', '慈溪市'],
                    ['浙江省', '宁波市', '奉化市'],
                    ['浙江省', '温州市', '鹿城区'],
                    ['浙江省', '温州市', '龙湾区'],
                    ['浙江省', '温州市', '瓯海区'],
                    ['浙江省', '温州市', '洞头区'],
                    ['浙江省', '温州市', '永嘉县'],
                    ['浙江省', '温州市', '平阳县'],
                    ['浙江省', '温州市', '苍南县'],
                    ['浙江省', '温州市', '文成县'],
                    ['浙江省', '温州市', '泰顺县'],
                    ['浙江省', '温州市', '瑞安市'],
                    ['浙江省', '温州市', '乐清市'],
                    ['浙江省', '嘉兴市', '南湖区'],
                    ['浙江省', '嘉兴市', '秀洲区'],
                    ['浙江省', '嘉兴市', '嘉善县'],
                    ['浙江省', '嘉兴市', '海盐县'],
                    ['浙江省', '嘉兴市', '海宁市'],
                    ['浙江省', '嘉兴市', '平湖市'],
                    ['浙江省', '嘉兴市', '桐乡市'],
                    ['浙江省', '湖州市', '市辖区'],
                    ['浙江省', '湖州市', '吴兴区'],
                    ['浙江省', '湖州市', '南浔区'],
                    ['浙江省', '湖州市', '德清县'],
                    ['浙江省', '湖州市', '长兴县'],
                    ['浙江省', '湖州市', '安吉县'],
                    ['浙江省', '绍兴市', '越城区'],
                    ['浙江省', '绍兴市', '柯桥区'],
                    ['浙江省', '绍兴市', '上虞区'],
                    ['浙江省', '绍兴市', '新昌县'],
                    ['浙江省', '绍兴市', '诸暨市'],
                    ['浙江省', '绍兴市', '嵊州市'],
                    ['浙江省', '金华市', '婺城区'],
                    ['浙江省', '金华市', '金东区'],
                    ['浙江省', '金华市', '武义县'],
                    ['浙江省', '金华市', '浦江县'],
                    ['浙江省', '金华市', '磐安县'],
                    ['浙江省', '金华市', '兰溪市'],
                    ['浙江省', '金华市', '义乌市'],
                    ['浙江省', '金华市', '东阳市'],
                    ['浙江省', '金华市', '永康市'],
                    ['浙江省', '衢州市', '柯城区'],
                    ['浙江省', '衢州市', '衢江区'],
                    ['浙江省', '衢州市', '常山县'],
                    ['浙江省', '衢州市', '开化县'],
                    ['浙江省', '衢州市', '龙游县'],
                    ['浙江省', '衢州市', '江山市'],
                    ['浙江省', '舟山市', '定海区'],
                    ['浙江省', '舟山市', '普陀区'],
                    ['浙江省', '舟山市', '岱山县'],
                    ['浙江省', '舟山市', '嵊泗县'],
                    ['浙江省', '台州市', '椒江区'],
                    ['浙江省', '台州市', '黄岩区'],
                    ['浙江省', '台州市', '路桥区'],
                    ['浙江省', '台州市', '玉环县'],
                    ['浙江省', '台州市', '三门县'],
                    ['浙江省', '台州市', '天台县'],
                    ['浙江省', '台州市', '仙居县'],
                    ['浙江省', '台州市', '温岭市'],
                    ['浙江省', '台州市', '临海市'],
                    ['浙江省', '丽水市', '莲都区'],
                    ['浙江省', '丽水市', '青田县'],
                    ['浙江省', '丽水市', '缙云县'],
                    ['浙江省', '丽水市', '遂昌县'],
                    ['浙江省', '丽水市', '松阳县'],
                    ['浙江省', '丽水市', '云和县'],
                    ['浙江省', '丽水市', '庆元县'],
                    ['浙江省', '丽水市', '景宁畲族自治县'],
                    ['浙江省', '丽水市', '龙泉市']
                ],
                value: [],

                gender: 0,
                genderOptions: ["男", "女"]
            }
        }
    }
</script>



